// 常用的正则规则
export const regExpConfig = {
  IDcard: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/, // 身份证
  mobile: /^1([3|4|5|7|8|])\d{9}$/, // 手机号码
  telephone: /^(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}$/, // 固定电话
  num: /^[0-9]*$/, // 数字
  numSix: /^[0-9]{6}/, // 6位数字
  numThirteen: /^[0-9]{13}$/, // 13位数字
  phoneNo: /(^1([3|4|5|7|8|])\d{9}$)|(^(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}$)/, // 电话或者手机
  policeNo: /^[0-9A-Za-z]{4,20}$/, // 警员账号4-16位数字或字母组成
  pwd: /^[0-9A-Za-z]{6,16}$/, // 密码由6-16位数字或者字母组成
  isNumAlpha: /^[0-9A-Za-z]*$/, // 字母或数字
  isIp: /^[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}/, // 是否ip地址
  isAlpha: /^[a-zA-Z]*$/, // 是否字母
  isNumAlphaCn: /^[0-9a-zA-Z\u4E00-\uFA29]*$/, // 是否数字或字母或汉字
  isIDcardCode: /^([0-9]*$|[0-9]*X$)/, // 是否数字和字母X
  isPostCode: /^[\d\-]*$/i, // 是否邮编
  isNumAlphaUline: /^[0-9+-]*$/, // 是否数字、+和-
  isNumAndThanZero: /^([1-9]\d*(\.\d+)?|0)$/, // 是否为整数且大于0/^[1-9]\d*(\.\d+)?$/
  isNormalEncode: /^(\w||[\u4e00-\u9fa5]){0,}$/, // 是否为非特殊字符（包括数字字母下划线中文）
  companyNO: /^qqb_[0-9a-zA-Z_]{1,}$/, // 公司人员账号
  imgType: /image\/(png|jpg|jpeg|gif)$/, // 上传图片类型
  imgType1: /image\/(png|jpg|jpeg)$/, // 上传图片类型
  setting_lon_1: /^[\-\+]?(0?\d{1,2}\.\d{0,15}|1[0-7]?\d{1}\.\d{1,15}|180\.0{0,15}|0?\d{1,2}|1[0-7]?\d{1}|180)$/, // 经度
  setting_lat_1: /^[\-\+]?([0-8]?\d{1}\.\d{0,15}|90\.0{0,15}|[0-8]?\d{1}|90)$/, // 纬度
  setting_lon_2: /^[EW]?((\d|[1-9]\d|1[0-7]\d)[\s\-,;°](\d|[0-5]\d)[\s\-,;′](\d|[0-5]\d)(\.\d{1,2})?[\s\-,;\″]?$)|(180[\s\-,;°]0[\s\-,;′分]0[\s\-,;\″]?$)/, // 经度（度分秒格式）
  setting_lat_2: /^[NS]?((\d|[1-8]\d)[\s\-,;°](\d|[0-5]\d)[\s\-,;′](\d|[0-5]\d)(\.\d{1,2})?[\s\-,;\″]?$)|(90[\s\-,;°]0[\s\-,;′分]0[\s\-,;\″]?$)/, // 纬度（度分秒格式）
  ispositive: /^(0|[1-9]\d*)$/, //非负整数
}